File loaded. Columns: Index(['GID', '省份', '城市', '厂站名', 'e文本厂站名', '日期', '统计类型', '00:00扣分详情',
       '00:15扣分详情', '00:30扣分详情',
       ...
       '21:30扣分详情', '21:45扣分详情', '22:00扣分详情', '22:15扣分详情', '22:30扣分详情',
       '22:45扣分详情', '23:00扣分详情', '23:15扣分详情', '23:30扣分详情', '23:45扣分详情'],
      dtype='object', length=103)
Filtered stations: 90
Long dataframe size: 2253
Final count: 2249
Total deduction: 14264.36
Grouped deduction:
厂站名
坤山风电场     2217.98
守旗光伏电站     269.34
寨安光伏电站     810.00
岑凡光伏电站      67.51
峙书光伏电站    1207.88
康宁光伏电站     641.00
弄滩光伏电站     964.00
强胜光伏电站     810.01
把荷风电场     2810.02
榕木光伏电站     306.00
樟木光伏电站     842.28
樟木风电场      492.44
武安风电场     2140.00
派岸光伏电站     206.50
浦峙光伏电站     479.40
Name: 扣分值, dtype: float64
